app/views/devise/registrations/new.html.erb

SELECT  "cities".* FROM "cities"  ORDER BY "cities"."id" ASC LIMIT 1
---
      <%= f.label :city_id %>
      <%= f.select :city_id, City.all.map { |city| [city.name, city.id] }, {}, {:class => 'selectpicker form-control'}  %>