app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "cities"
---
  def index
    @cities = City.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "LNa"], ["created_at", "2015-02-28 02:05:06.028208"], ["updated_at", "2015-02-28 02:05:06.028208"]]
---
  def create
    @city = City.new(city_params)
    @city.save

UPDATE "cities" SET "short_name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["short_name", "LN"], ["updated_at", "2015-02-28 03:48:26.563299"], ["id", 1]]
---
  def update
    @city.update(city_params)